hybridMultiphaseFoamV7/tutorials/Darcy_Flow_Cases/Buckley-Leverett/Gravity_Driven_BrooksCorey/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue epss 0.5
    volScalarFieldValue alpha.wetting 0.002
);

regions
(

     boxToCell //left boundary
    {
        box (0 0 0) (0.025 0.4 1);
        fieldValues
        (
	//    volScalarFieldValue alpha.wetting 0.1
        );
    }

);


// ************************************************************************* //
